Lesson2/myPtrList/testCase/Allrun
#!/bin/bash

./Allclean

blockMesh

myPtrList
