Lesson2/myPtrList/testCase/constant/testDict
// the header is required
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      testDict;
}


group
(
	shen
	{
		name	"Zhirong_Shen";
		ID  	111;
	}

	liu
	{
		name	"Yuanchuan_Liu";
		ID		121;
	}

	ye 
	{
		name	"Haixuan_Ye";
		ID		131;
	}

	yang
	{
		name	"Yongqian_Yang";
		ID		141;
	}

);
